Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat_bidir_ltct.c
	}
}




//avoidShowingRepeatParameters
void handleDisplay_Gujarat(uint8_t t)
{// disp_timer is incremented in the interrupt callback function
	uint8_t previous_disp_state;
  powermgmt_mode_t power_mode;

//	disp_autoscroll_interval=5;
	
	if((g_display_mode==255)||(seconds_flag==0))	// things are not ready yet
		return;
		
		
	power_mode = POWERMGMT_GetMode();	// actual function to be used
		
	if (power_mode == POWERMGMT_MODE1)
	{
#ifdef BIDIR_METER		
		if((g_display_mode==0)&&(disp_state==45))
#else
		if((g_display_mode==0)&&(disp_state==0))
#endif
		{
		}
		else
			EM_LCD_DisplayStatus();
	}

  if((disp_timer >= disp_autoscroll_interval)||(someKeyPressed==1)||(fast_display_flag==1))
	{
		seconds_flag=0;

		if(someKeyPressed==0)
		{
			if(g_display_mode==0)
			{
				if(autoscrollInButtonMode==0)
				{
					previous_disp_state = disp_state;
					if(fast_display_flag==0)
					{
						if(alt_autoscroll_mode==0)
							disp_state++;
						else
						{
							sub_disp_state++;
//							if(sub_disp_state==3)
							if(sub_disp_state==NO_OF_SUB_DISPLAY_STATES)
							{
								sub_disp_state=255;
								alt_autoscroll_mode=0;
								disp_state++;
							}
						}
					}
					else
					{// here fast_display_flag = 1 - wait for autoscroll interval before incrementing state
						fast_display_counter++;
						if(fast_display_counter>disp_autoscroll_interval)
						{
//							disp_state++;
							fast_display_flag=0;
							fast_display_counter=0;
							alt_autoscroll_mode=1;
							sub_disp_state=255;
						}
					}
				}
			}
			else
			{// here we are in those modes which are supposed to operate by pushbutton
			// once button is pressed scrollLock will be made 1, and now display will not scroll
				if(scrollLock==0)
				{
					disp_autoscroll_interval=10;
					disp_state++;	// allow the other displays to scroll if no button is pressed
				}
			}
			disp_timer=0;
		}
		else
		{// here some key has been pressed
			if(mode_has_been_changed==1)
			{
				someKeyPressed=1;	// make sure this remains 1
				if(disp_timer>=2)
				{
					mode_has_been_changed=0;
					fwdKeyPressed=0;	// this is to ensure that after mode display is cleared user must press either key to proceed
					revKeyPressed=0;
				}
				return;
			}
			else
			{
				disp_timer=0;
				someKeyPressed=0;
				mode_timeout_ctr=0;
				avoidShowingRepeatParameters=1;
				scrollLock=1;	// now it will scroll only with press of button
			}
			
			if(fwdKeyPressed==1)
			{
				fwdKeyPressed=0;
				fwdKeyPressedCtr=0;
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						sub_disp_state=0;
						displayRepeatParameters();	
					}
					else
					{// here autoscrollInButtonMode is 1 and fwdKey is pressed
						if(sub_disp_state==255)
						{
							disp_state++;
							
#ifdef BIDIR_METER								
							if(disp_state>45)
#else
							if(disp_state>19)
#endif
							{// this means that now we are going to come back to state 0
								sub_disp_state=0;
								displayRepeatParameters();	
							}
							else
							 display_autoScroll();
						}
						else
						{
							sub_disp_state++;
//							if(sub_disp_state==3)
							if(sub_disp_state==NO_OF_SUB_DISPLAY_STATES)
							{
								sub_disp_state=255;
								disp_state=0;
								display_autoScroll();
							}
							else
								displayRepeatParameters();
						}
					}
//					return;
				}
				else
					disp_state++;
			}
			
			if(revKeyPressed==1)
			{
				revKeyPressed=0;
				revKeyPressedCtr=0;
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						sub_disp_state=0;
						displayRepeatParameters();	
					}
					else
					{// here autoscrollInButtonMode is in button mode and REV key is pressed
						if((sub_disp_state>=1)&&(sub_disp_state!=255))
						{
							sub_disp_state--;
							displayRepeatParameters();
						}
						else
						{// here sub_disp_state is either 0 or it is 255
							if((sub_disp_state==0)||(sub_disp_state==255))
							{
								sub_disp_state=255;
								
								if(disp_state==0)
								{// rev button has been pressed
#ifdef BIDIR_METER								
									disp_state=45;
#else
									disp_state=19;
#endif
									display_autoScroll();
								}
								else
								{
									if((disp_state>=1)&&(disp_state!=255))
									{
										disp_state--;
										display_autoScroll();
									}
								}
							}
						}
//						return;	
					}
				}
				else
				{
					if(disp_state==0)
					{
						if(g_display_mode==1)
						{// we are in displayOnDemand mode
#ifdef BIDIR_METER
							disp_state=14;
#else
							disp_state=26;
#endif							
						}
						else
						{
							if(g_display_mode==2)
							{// we are in high res display mode - this has same number of display states for both UNIDIR and BIDIR
								disp_state=3;
							}
						}
					}
					else
					{
//						if(disp_state>=1)
							disp_state--;
					}
				}
			}
		}
		
//		if(mode_has_been_changed==1)
//			return;
			
		switch(g_display_mode)
		{
			case 0:	// autoscroll
				if(autoscrollInButtonMode==0)
				{
					if(alt_autoscroll_mode==0)
					{
						display_autoScroll();
						if((previous_disp_state!=disp_state)&&(fast_display_flag==0)&&(avoidShowingRepeatParameters==0))
						{
							alt_autoscroll_mode=1;
							sub_disp_state=255;
						}
					}
					else
						displayRepeatParameters();
				}
				else
				{// here autoscroll is in button mode
					if(fast_display_flag==1)
						display_autoScroll();
				}
				break;
				
			case 1:	// pushbutton
				display_onDemand();
				break;
				
			case 2:	// third display mode
				display_Third();
				break;
				
			default:
				makeDisplayReadyForAutoScroll();
				break;
		}
	}
}


#ifdef BIDIR_METER
void displayRepeatParameters(void)
{
	int32_t tempTodKwh;
	uint16_t tempint;
  powermgmt_mode_t power_mode;
	uint8_t tempchar;
	uint8_t tmonth;
	
  LCD_ClearAll();
	disp_autoscroll_interval=10;
	
	if(someKeyPressed==0)
	{	
		if(((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)&&(autoscrollInButtonMode==0))
		{
			LCD_DisplayDigit(2, LCD_CHAR_C);
			LCD_DisplayDigit(3, LCD_MINUS_SIGN);
			LCD_DisplayDigit(4, 0);
			LCD_DisplayDigit(5, LCD_CHAR_P);
			LCD_DisplayDigit(6, LCD_CHAR_E);
			LCD_DisplayDigit(7, LCD_CHAR_N);
			return;
		}
	}
	else
		someKeyPressed=0;
	
	if((comm_mode!=0)&&(autoscrollInButtonMode==0))
	{
		LCD_DisplayDigit(2, LCD_CHAR_D);
		LCD_DisplayDigit(3, LCD_CHAR_N);
		LCD_DisplayDigit(4, LCD_CHAR_L);
		LCD_DisplayDigit(5, LCD_CHAR_D);
		return;
	}
	
	
