Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat_bidir_ltct.c
	power_mode = POWERMGMT_GetMode();	// actual function to be used
	if (power_mode == POWERMGMT_MODE1)
		EM_LCD_DisplayStatus();

	if(sub_disp_state>NO_OF_SUB_DISPLAY_STATES)
		sub_disp_state=0;	

	switch(sub_disp_state)
	{
    case 0:		// total kwh - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
  		LCD_DisplaySpSign(S_IMPORT);
     	break;

    case 1:		// total kwh - Cumulative Export
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh_export/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
  		LCD_DisplaySpSign(S_EXPORT);
     	break;

    case 2:		//Total Cumulative Import kwh	-	Solar hours script id 1, (scriptid-1)=0
			tempchar=0;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
			if(tempchar==presentZone)
			{
				tempTodKwh=myenergydata.zone_kwh; // myenergydata.zone_kwh
			}
			
//			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
//			display_long_one_dp(tempTodKwh/100);
			LCD_DisplayIntWithPos(tempTodKwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
     break;

    case 3:		//Total Cumulative Export kwh	-	Solar hours script id 1, (scriptid-1)=0
			tempchar=0;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC+32, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
			if(tempchar==presentZone)
			{
				tempTodKwh=myenergydata.zone_kwh_export; // myenergydata.zone_kwh
			}
			
//			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
//			display_long_one_dp(tempTodKwh/100);
			LCD_DisplayIntWithPos(tempTodKwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
     break;
			
    case 4:		// total kvarh - lag
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvarh_lag/1000, LCD_LAST_POS_DIGIT,0);
//			display_long_one_dp(myenergydata.kvarh_lag/100);
			LCD_DisplaykVArhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
  		LCD_DisplaySpSign(S_IMPORT);
  		LCD_DisplaySpSign(S_LAG);
     	break;
			
    case 5:		// Cumulative MD in kW
			LCD_DisplayIntWithPos(ctldata.cumulative_md/1000, LCD_LAST_POS_DIGIT,0);
//			display_long_three_dp(ctldata.cumulative_md);
//	    LCD_DisplayDigit(1, LCD_CHAR_C);
			LCD_DisplaykWSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
		  LCD_DisplaySpSign(S_MD);
  		LCD_DisplaySpSign(S_IMPORT);
      break;
	}
}

// this is a private function for the display_autoScroll to prevent flickering
// when tod is displayed
void displayPrepare(void);

void displayPrepare(void)
{
  LCD_ClearAll();	
	if(disp_state<45)
		EM_LCD_DisplayStatus();
}

void display_autoScroll(void)
{
	float32_t tempFloat;
	int32_t tempTodKwh;
	int32_t tempLong;
	int32_t tempLong1;
	uint16_t tempTodMD;
	uint16_t tempint;
  int16_t i[EM_NUM_OF_LINE];
	
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;

  R_WDT_Restart();
	
	
	if(((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)&&(autoscrollInButtonMode==0))
	{
	  LCD_ClearAll();	
		LCD_DisplayDigit(2, LCD_CHAR_C);
		LCD_DisplayDigit(3, LCD_MINUS_SIGN);
		LCD_DisplayDigit(4, 0);
		LCD_DisplayDigit(5, LCD_CHAR_P);
		LCD_DisplayDigit(6, LCD_CHAR_E);
		LCD_DisplayDigit(7, LCD_CHAR_N);
		return;
	}
	
	if((comm_mode!=0)&&(autoscrollInButtonMode==0))
	{
	  LCD_ClearAll();	
		LCD_DisplayDigit(2, LCD_CHAR_D);
		LCD_DisplayDigit(3, LCD_CHAR_N);
		LCD_DisplayDigit(4, LCD_CHAR_L);
		LCD_DisplayDigit(5, LCD_CHAR_D);
		return;
	}

/*	
  LCD_ClearAll();	
	if(disp_state<47)
		EM_LCD_DisplayStatus();
*/

	if(disp_state>45)
		disp_state=0;

	switch(disp_state)
	{
    case 0:		// meter number
			displayPrepare();
		  lcd_display_multiple_chars(0,6,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(Common_Data.meterNumber, LCD_LAST_POS_DIGIT,0);
			lcd_display_id();
			fast_display_flag=0;
     	break;
	
    case 1:		// Voltage - R
			displayPrepare();
			tempLong = getInstantaneousParams(IVOLTS,LINE_PHASE_R)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_R);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
      break;

    case 2:		// Voltage - Y
			displayPrepare();
			tempLong = getInstantaneousParams(IVOLTS,LINE_PHASE_Y)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_Y);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
      break;

    case 3:		// Voltage - B
			displayPrepare();
			tempLong =getInstantaneousParams(IVOLTS,LINE_PHASE_B)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_B);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
	    break;

    case 4:		// Current - R with direction
			displayPrepare();
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_R)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			lcd_display_A();
			fast_display_flag=1;
      break;

    case 5:		// Current - Y with direction
			displayPrepare();
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_Y)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_Y);
			lcd_display_A();
			fast_display_flag=1;
      break;

   	case 6:		// Current - B with direction
			displayPrepare();
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_B)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_B);
			lcd_display_A();
			fast_display_flag=1;
      break;
			
		case 7:		// Line Frequency
			displayPrepare();
			tempLong = getInstantaneousParams(IFREQS,LINE_TOTAL)*100;
			display_long_two_dp(tempLong);
  		LCD_DisplayDigit(1, LCD_CHAR_F);
	    LCD_DisplayDigit(9, LCD_CHAR_H);
	    LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
     break;

