Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat_bidir_ltct.c
		case 8:		// Phase Sequence - Voltage
				displayPrepare();
// The array i is being used to store voltages
				i[LINE_PHASE_R] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_R)*10);
				i[LINE_PHASE_Y] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_Y)*10);
				i[LINE_PHASE_B] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_B)*10);
				
				tempchar = countVoltageLT50(i[LINE_PHASE_R],i[LINE_PHASE_Y],i[LINE_PHASE_B]);
				if(tempchar==0)
//				if((g_TamperStatus&MISSPOT_MASK)==0)
				{// here no potential is missing
					if(gPhaseSequence==0)
					{
						LCD_DisplayDigit(3, LCD_CHAR_R);
						LCD_DisplayDigit(4, LCD_CHAR_Y);
						LCD_DisplayDigit(5, LCD_CHAR_B);
					}
					else
					{
						LCD_DisplayDigit(3, LCD_CHAR_R);
						LCD_DisplayDigit(4, LCD_CHAR_B);
						LCD_DisplayDigit(5, LCD_CHAR_Y);
					}
				}
				else
				{// here some potential is missing
					LCD_DisplayDigit(3, LCD_MINUS_SIGN);
					LCD_DisplayDigit(4, LCD_MINUS_SIGN);
					LCD_DisplayDigit(5, LCD_MINUS_SIGN);
				}

	    LCD_DisplayDigit(1, LCD_CHAR_V);
	    LCD_DisplayDigit(9, LCD_CHAR_P);
	    LCD_DisplayDigit(8, 5);
			fast_display_flag=1;
     break;

		case 9:		// Phase Sequence - Current
			displayPrepare();
#ifdef CURRENT_PHASE_SEQUENCE		
		  i[LINE_PHASE_R] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_R)*100);
		  i[LINE_PHASE_Y] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_Y)*100);
		  i[LINE_PHASE_B] = (int16_t)(EM_EXT_GetIRMS(LINE_PHASE_B)*100);
			
			tempchar = countCurrentGT95(i[LINE_PHASE_R],i[LINE_PHASE_Y],i[LINE_PHASE_B]);

			if(tempchar==3)
			{
				if(gPhaseSequenceCurrent==0)
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_Y);
					LCD_DisplayDigit(5, LCD_CHAR_B);
				}
				else
				{
					LCD_DisplayDigit(3, LCD_CHAR_R);
					LCD_DisplayDigit(4, LCD_CHAR_B);
					LCD_DisplayDigit(5, LCD_CHAR_Y);
				}
			}
			else
			{// here all currents are not greater than 1A
				LCD_DisplayDigit(3, LCD_MINUS_SIGN);
				LCD_DisplayDigit(4, LCD_MINUS_SIGN);
				LCD_DisplayDigit(5, LCD_MINUS_SIGN);
			}
#endif
	    LCD_DisplayDigit(1, LCD_CHAR_C);
	    LCD_DisplayDigit(9, LCD_CHAR_P);
	    LCD_DisplayDigit(8, 5);
			fast_display_flag=1;
     break;
		 
    case 10:		// pf total with sign
			displayPrepare();
    	pf_sign = (EM_PF_SIGN)getInstantaneousParams(PFSIGNVAL,LINE_TOTAL);
			tempLong = getInstantaneousParams(IPFS,LINE_TOTAL)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(1, LCD_CHAR_P);	
			LCD_DisplayDigit(2, LCD_CHAR_F);	

			LCD_DisplayDigit(9, LCD_CHAR_T);
			
			if(total_active_power>0)
			{// this is the regular case - import
				if (pf_sign == PF_SIGN_LEAD_C)
				{
		    	LCD_DisplaySpSign(S_LEAD);
				}
				else if (pf_sign == PF_SIGN_LAG_L)
				{
		    	LCD_DisplaySpSign(S_LAG);
				}
			}
			else
			{
				if (pf_sign == PF_SIGN_LEAD_C)
				{
				    LCD_DisplaySpSign(S_LAG);	// show the ulta
				}
				else if (pf_sign == PF_SIGN_LAG_L)
				{
				    LCD_DisplaySpSign(S_LEAD);	// show the ulta
				}
			}
			fast_display_flag=1;
		 break;

    case 11:		// Instant Load in kW
			displayPrepare();
//			tempLong = getInstantaneousParams(ACT_POWER,LINE_TOTAL);
			tempLong = (int32_t)EM_GetActivePower(LINE_PHASE_R);	// with sign
			tempLong += (int32_t)EM_GetActivePower(LINE_PHASE_Y);	// with sign
			tempLong += (int32_t)EM_GetActivePower(LINE_PHASE_B);	// with sign
			
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykWSign();
			fast_display_flag=1;
	    break;

    case 12:		// date
			displayPrepare();
			EM_DisplayDate();
			fast_display_flag=0;
      break;

    case 13:		// day
			tempchar = (uint8_t)CalcDayNumFromDate((2000+rtc.year), rtc.month, rtc.date);
			displayPrepare();
			displayDay(tempchar);
			fast_display_flag=0;
      break;
			
    case 14:		// time
			displayPrepare();
			EM_DisplayInstantTime();
			fast_display_flag=1;
      break;

    case 15:		// Rising MD in kW
			displayPrepare();
	    tempchar=60/(int32_t)Common_Data.mdinterval;
			tempLong = (int32_t)EM_GetActivePower(LINE_PHASE_R);
			tempLong += (int32_t)EM_GetActivePower(LINE_PHASE_Y);
			tempLong += (int32_t)EM_GetActivePower(LINE_PHASE_B);
			
			tempLong1 = tempLong;
			if(tempLong1<0)
				tempLong1*=-1;	// this is now always positive
				
			if(tempLong1<7)
			{// here there is zero active power
				if(previousMode==0)
				{// import mode
					tempTodKwh = ((myenergydata.kwh-ctldata.kwh_last_saved)*(int32_t)tempchar);
					if(tempTodKwh<0)
					{	ctldata.kwh_last_saved=myenergydata.kwh;
						tempTodKwh=0;
					}
					display_long_three_dp(tempTodKwh);	// rising MD
			  	LCD_DisplaySpSign(S_IMPORT);
				}
				else
				{// export mode
					tempTodKwh = ((myenergydata.kwh_export-ctldata.kwh_last_saved_export)*(int32_t)tempchar);
					if(tempTodKwh<0)
					{	ctldata.kwh_last_saved_export=myenergydata.kwh_export;
						tempTodKwh=0;
					}
					display_long_three_dp(tempTodKwh);	// rising MD
			  	LCD_DisplaySpSign(S_EXPORT);
				}
			}
			else
			{// here there is some active power - may be positive or negative
				if(tempLong>0)
				{// import case - present active power is +ve
					previousMode = 0;	// import mode
					tempTodKwh = ((myenergydata.kwh-ctldata.kwh_last_saved)*(int32_t)tempchar);
					if(tempTodKwh<0)
					{	ctldata.kwh_last_saved=myenergydata.kwh;
						tempTodKwh=0;
					}
					display_long_three_dp(tempTodKwh);	// rising MD
			  	LCD_DisplaySpSign(S_IMPORT);
				}
				else
				{// export case - present active power is -ve
					previousMode = 1;	// export mode
					tempTodKwh = ((myenergydata.kwh_export-ctldata.kwh_last_saved_export)*(int32_t)tempchar);
					if(tempTodKwh<0)
					{	ctldata.kwh_last_saved_export=myenergydata.kwh_export;
						tempTodKwh=0;
					}
					display_long_three_dp(tempTodKwh);	// rising MD
			  	LCD_DisplaySpSign(S_EXPORT);
				}
			}
			
			LCD_DisplaykWSign();
	    LCD_DisplaySpSign(S_TIME);	// show the time icon also

// we can also display the minutes elapsed
			tempchar = rtc.minute - ((rtc.minute/Common_Data.mdinterval)*Common_Data.mdinterval); 
  		LCD_DisplayDigit(1, LCD_CHAR_R);
  		LCD_DisplayDigit(2, LCD_CHAR_D);
  		LCD_DisplayDigit(9, tempchar/10);
  		LCD_DisplayDigit(8, tempchar%10);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=1;
      break;

    case 16:		// total kwh - Cumulative  Import KWH 
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			fast_display_flag=1;
     	break;
			
