Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Gujarat_bidir_ltct.c
    case 17:		// total kwh - Cumulative Export
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kwh_export/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=1;
     	break;
			
    case 18:		// total kvarh - lag import
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvarh_lag/100);
			LCD_DisplaykVArhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplaySpSign(S_LAG);
			fast_display_flag=1;
     	break;
			
    case 19:		// total kvarh - lag export
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvarh_lag_export/100);
			LCD_DisplaykVArhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplaySpSign(S_LAG);
			fast_display_flag=1;
     	break;
			
    case 20:		// total kvah import
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvah/100);
			LCD_DisplaykVAhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			fast_display_flag=1;
     	break;
			
    case 21:		// total kvah export
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvah_export/100);
			LCD_DisplaykVAhSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=1;
     	break;
			
// Cum Import KWH Solar hours
    case 22:		//Import kwh	-	Solar hours script id 1, (scriptid-1)=0
			tempchar=0;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
			if(tempchar==presentZone)
			{
				tempTodKwh=myenergydata.zone_kwh; // myenergydata.zone_kwh
			}
			
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(tempTodKwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
			fast_display_flag=1;
     break;

// Cum Import KWH Rest hours
    case 23:			// Import kwh - Rest Hours script id 2, (scriptid-1)=1
			tempchar=1; // this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
			if(tempchar==presentZone)
			{
				tempTodKwh=myenergydata.zone_kwh;
			}

			displayPrepare();
			lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(tempTodKwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
			fast_display_flag=1;
      break;

// Cum Export KWH Solar hours
    case 24:		//Export kwh	-	Solar hours script id 1, (scriptid-1)=0
			tempchar=0;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC+32, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
			if(tempchar==presentZone)
			{
				tempTodKwh=myenergydata.zone_kwh_export; // myenergydata.zone_kwh
			}
			
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(tempTodKwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
			fast_display_flag=1;
     break;

// Cum Export KWH Rest hours
    case 25:			// Export kwh - Non solar Hours script id 2, (scriptid-1)=1
			tempchar=1; // this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+tempchar*ZONE_PTR_INC+32, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
			if(tempchar==presentZone)
			{
				tempTodKwh=myenergydata.zone_kwh_export;
			}

			displayPrepare();
			lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(tempTodKwh/100);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_TOD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
			fast_display_flag=1;
      break;			
			
// MD Import kw for present Billing Period
    case 26:		// Current MD in kW
			displayPrepare();
			display_long_three_dp(mymddata.mdkw);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaySpSign(S_IMPORT);
			fast_display_flag=0;
      break;
			
// MD Import kw for present Billing Period - Solar Hours
    case 27:		//MD Import kw	-	Solar hours script id 1, (scriptid-1)=0
			tempchar=0;	// this is now (scriptid -1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+12+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Import kw for present Billing Period - Rest Hours
    case 28:		//MD Import kw	-	script id 2, (scriptid-1)=1
			tempchar=1;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+12+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Import kw for last Billing Period - this is now 4 bytes
    case 29:		// L1 - MD
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+80,(uint8_t*)&tempLong,4);
			displayPrepare();
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplaykWSign();
			LCD_DisplaySpSign(S_IMPORT);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
	    break;

// MD Import kw for last Billing Period - Solar Hours - 4bytes
    case 30:		//MD Import kw	-	Solar hours script id 1, (scriptid-1)=0
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=0;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 96 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// MD Import kw for last Billing Period - Rest Hours
    case 31:		//MD Import kw	-	Night hours script id 2, (scriptid-1)=1
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=1; // this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 96 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_IMPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// MD Export kw for present Billing Period
    case 32:		// Current MD Export in kW
			displayPrepare();
			display_long_three_dp(mymddata.mdkw_export);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=0;
      break;

// MD Export kw for present Billing Period - Solar Hours
    case 33:		//MD Export kw	-	Peak hours script id 1, (scriptid-1)=0
			tempchar=0;
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+40+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Export kw for present Billing Period - Rest Hours
    case 34:		//MD Export kw	- Night hours	script id 2, (scriptid-1)=1
			tempchar=1;	// this is now (scriptid-1)
			EPR_Read(TOD_CURRENT_BASE_ADDRESS+40+tempchar*ZONE_PTR_INC, (uint8_t*)&tempTodMD, sizeof(tempTodMD));
			displayPrepare();
			display_long_three_dp(tempTodMD);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     break;

// MD Export kw for last Billing Period
    case 35:		// L1 - MD Export 
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+372,(uint8_t*)&tempLong,sizeof(tempLong));
			displayPrepare();
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplaykWSign();
			LCD_DisplaySpSign(S_EXPORT);
			fast_display_flag=0;
	    break;

// MD Export kw for last Billing Period - Solar Hours
    case 36:		//MD Export kw	-	Solar hours , scriptid 1, (scriptid-1)=0
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=0;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 388 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, 5);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;
			
// MD Export kw for last Billing Period - Rest Hours
    case 37:		//MD Export kw	-	Rest hours scriptid 2, (scriptid-1)=1
		// this information is to be picked up from Billing area in e2rom
      tmonth = decrementMonth(1);
			tempchar=1;	// this is now (scriptid-1)
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + 388 + (tempchar*4),(uint8_t*)&tempLong1,sizeof(tempLong1));
			displayPrepare();
			display_long_three_dp(tempLong1);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_TOD);
			LCD_DisplaySpSign(S_EXPORT);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, LCD_CHAR_H);
		  LCD_DisplaySpSign(S_MD);	// this must be done after displaying digit 8
			fast_display_flag=0;
     	break;

// Non Solar hour Export kwh
    case 38:		//Non Solar Export kwh
			displayPrepare();
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kwh_nonSolar_export/100);
			LCD_DisplaykWhSign();
			LCD_DisplaySpSign(S_EXPORT);
 	    LCD_DisplayDigit(9, LCD_CHAR_N);
 	    LCD_DisplayDigit(8, 5);
			fast_display_flag=1;
			break;

// Cumulative MD in Import KW
    case 39:		// Cumulative MD in kW
			displayPrepare();
			display_long_three_dp(ctldata.cumulative_md);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
		  LCD_DisplaySpSign(S_MD);
  		LCD_DisplaySpSign(S_IMPORT);
			fast_display_flag=0;
      break;

// Reset Count - billing count
    case 40:		// billing count
			displayPrepare();
			LCD_DisplayIntWithPos(Common_Data.bpcount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_P);
		  LCD_DisplaySpSign(S_D1);	// this will convert the P to R
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

